{
    "Dentistry": [
        "Can you tell us about your motivation for pursuing a career in dentistry?",
        "Can you describe a time when you had to work effectively under pressure?",
        "Can you tell us about a challenging situation you have faced and how you overcame it?",
        "What do you think are the most important qualities of a good dentist?",
        "How do you stay up-to-date with developments in dentistry and oral health?",
        "How do you approach patient care and communication?",
        "Can you describe a difficult ethical situation you have faced and how you resolved it?",
        "How do you handle conflict with team members or patients?",
        "Can you tell us about a research project you have undertaken or a paper you have read recently in the field of dentistry?",
        "How would you prioritize tasks and manage your time effectively in a busy clinical setting?",
        "What is the process of tooth decay and how can it be prevented?",
        "Describe the different types of dental restorations and their indications.",
        "How do you approach a patient with dental anxiety or phobia?",
        "What is the role of a dentist in promoting oral hygiene and preventing dental caries?",
        "In what ways do you consider the well-being and autonomy of your patients?",
        "How do you envision promoting diversity, equity, and inclusion in your future dental practice?",
        "Can you describe the different methods used for local anaesthesia in dentistry?",
        "How do you plan to address and prevent medical errors in your practice?",
        "In what ways do you consider the impact of your work on the environment and society?",
        "In a situation where a patient requests a procedure that you believe is not in their best interest, how would you handle the situation?",
        "In your opinion, what role should dentists play in promoting oral health and disease prevention for their patients?",
        "What is the role of dental imaging technology in diagnosis and treatment planning?",
        "What is the importance of dental research and how does it inform current clinical practices?",
        "What is the purpose of root canal therapy and how is it performed?",
        "What do you see as the most significant challenges facing the dental profession today?",
        "What is the role of a dentist in promoting oral health and disease prevention for their patients?",
        "Can you tell us about a recent development in dentistry that interests you?",
        "What do you think are the most important qualities for a dentist to have?",
        "How do you plan to stay current with new advances and technologies in dentistry throughout your career?",
        "A patient comes into your practice with significant caries involvement. You find out whilst conversing that they do not use fluoride toothpaste as they read online that charcoal toothpaste whitens teeth and is less toxic. How would you encourage this patient to improve their oral health?",
        "You are a dentist with a patient who has dental pain. After examination you cannot determine the causation of the pain without taking a radiograph and you suggest this to the patient. She refuses and says she believes radiographs are bad and will negatively impact her health. What do you do?",
        "A patient has come in and is HIV-positive, your nurse REFUSES to treat him how would you treat this patient?",
        "A patient with severe anxiety comes into your practice. Every time you approach them with a drill they panic and refuse to open their mouth. How would you manage the patient?",
        "A heavy drug user and a respected council representative are in need of dental care however you only have time to treat one. Who would you treat and why?",
        "You overhear a senior dental professor speak about patient details to a colleague and hear them make fun of the patient. What would you do in this situation?",
        "Your practice manager (dentist) has not been coming to work consistently and you have had to work overtime to cover their shifts. They tell you they are suffering from depression. How will you deal with this situation?",
        "You are struggling with your first exam in dentistry. Your friend knows this and sends you the leaked exam paper for the semester. What do you do in this situation?",
        "On your first day as a foundation dentist you are told to do a procedure you have never done before. Your boss says that this is an easy procedure and you shouldn't struggle ; what do you do in this situation?",
        "A patient comes into your practice for a regular checkup. As you are probing their tooth you accidentally expose their pulp. Because of this the patient now needs to get a root canal treatment or extraction. What would you do in this situation?",
        "You have told your long time friend that you would take them out to dinner but you have been called in for an emergency appointment 5 minutes before you need to leave. Break the news.",
        "You have just received results from a biopsy of a patient confirming your fears that they have oral cancer. Break the news to the Patient",
        "You have to break the news to a patient that you their hamster has to have their leg amputated due to a complication during surgery.",
        "Explain to an 83 year old person how to book tickets online for a culinary class in London.",
        "You have to explain how to tie your shoelaces to a 20 year old that as never tied their shoes before.",
        "You are late for work and drive off your driveaway without looking at your mirrors. You hear a crunch and realise you have just killed your neighbour’s dog. Break the news to the neighbour.",
        "You have told your best friend that you would take them out to Hakkasan but you have been called in for an emergency appointment 5 minutes before you need to leave. Break the news.",
        "Make and explain an oral hygiene regime to a 6 year old",
        "Explain to someone who has never been in a kitchen how to make a cup of tea with 2 sugars",
        "What is your favourite movie or tv show?",
        "What is your favourite book?",
        "How do you deal with stress?",
        "Who is the most important member of the dental team?",
        "How many pennies can you fit in your room?",
        "Compare and contrast NHS v Private dentistry",
        "How do you think others would describe you?",
        "Tell me a situation where you had to deal with a difficult person",
        "Tell me a situation where you showed manual dexterity skills",
        "How many coffees are consumed in the UK per day?",
        "Why is a tennis ball fuzzy?",
        "What is the most important thing you have learned in your life?",
        "A windowless room has 3 lightbulbs, You are outside the room with 3 switches. One switch controls each lightbulb. You can only enter the room once. How do you determine which switch controls which lightbulb?",
        "You are a Summer Camp Counsellor and you notice that one of your campers seems down. You approach your camper, and he admits that he feels isolated and lonely, having trouble making friends. Your camper admits that he takes illicit substances, but he asks you not to tell any authority figure about this. How would you approach this situation?",
        "Your best friend calls you and tells you that his girlfriend broke up with him. He is extremely “depressed,” and states that he wants to end his life. How would you approach this situation?",
        "You are playing football in the back garden when you accidentally kick a ball over the fence and hear a smash. You find that it has destroyed your elderly neighbour’s garden gnome, which you know holds great sentimental value to them. How would you break the news?"
    ],
    "Medicine": [
        "Why do you want to be a doctor?",
        "What makes you a good candidate for medical school?",
        "What are your strengths and weaknesses?",
        "How do you cope with stress?",
        "What is your greatest achievement?",
        "What is your greatest failure?",
        "Would you prescribe the oral contraceptive (the pill) ro a 14-year old girl who is having sex with her boyfriend?",
        "How do you see the UK's healthcare system in 20 years' time?",
        "If you had £1 billion to spend on one element of healthcare, what would you spend it on and why?",
        "What single healthcare intervention could change the health of the population the most?",
        "What experiences have influenced your decision to pursue a career in medicine?",
        "How do you plan to contribute to the diversity of the medical school class and the healthcare workforce?",
        "How do you handle difficult or emotional situations with patients or their families?",
        "How many pennies can you fit in your room?",
        "A windowless room has 3 lightbulbs, You are outside the room with 3 switches. One switch controls each lightbulb. You can only enter the room once. How do you determine which switch controls which lightbulb?",
        "Why is a tennis ball fuzzy?",
        "What should the main goal of medicine be?",
        "Should the UK follow opt-in or opt-out organ donation? Why?",
        "What is the most important thing you have learned in your life?",
        "What is your favourite movie or tv show?",
        "What is your favourite book?",
        "When is it appropriate to breach patient-doctor confidentiality?",
        "Should medical research be conducted on animals?",
        "How should medical professionals approach the issue of assisted suicide, what do you know about Dignitas?",
        "You have one dialysis machine to share between three patients with equal medical need. One is a 17-year-old drug addict who has just overdosed, one is a 40-year old woman with terminal breast cancer and only 6 months of life expectancy, the third one is a 70-year old marathon runner. Who gets the machine?",
        "Is it ever acceptable for doctors to go on strike?",
        "Where do you get your medical news from?",
        "Should medical professionals be held accountable for medical errors and mistakes?",
        "What did the medical community learn from the case of Harold Shipman?",
        "What are the key principles of the NHS in your opinion?",
        "How can the NHS maintain its commitment to providing free and universal healthcare in the face of budget constraints and political challenges?",
        "How is the NHS structured?",
        "Why do you think that so many NHS doctors and nurses are moving to Australia to work there instead, what does a doctor look for?",
        "What role do you think the NHS should play in addressing the challenges of climate change and environmental sustainability?",
        "How do you think the COVID-19 pandemic has affected patient-doctor relationships and trust in the healthcare system?",
        "Who is most responsible for the deaths from covid-19?",
        "Tell me about the covid-19 virus.",
        "Is it right to hail healthcare workers as heroes? Is it helpful?",
        "How do vaccines work?",
        "Explain antibiotic resistance.",
        "What are the mechanisms and treatments of neurodegenerative diseases such as Alzheimer's or Parkinson's?",
        "What diseases might be associated with research into stem cells?",
        "What are the mechanisms and treatments of mental health disorders such as anxiety or depression?",
        "Fashion has changed hugely over the past 400 years. What do you think we'll be wearing in 200 years from now?",
        "You are a judge for the XYZ School of Medicine Scholarship. Discuss how you would decide who will win this scholarship.",
        "How much does an Elephant weigh?",
        "What 3 people from throughout history would you invite to your dinner party and why?",
        "How do you think the rising cost of healthcare will impact the way medicine is practiced in the future?",
        "You are a Summer Camp Counsellor and you notice that one of your campers seems down. You approach your camper, and he admits that he feels isolated and lonely, having trouble making friends. Your camper admits that he takes illicit substances, but he asks you not to tell any authority figure about this. How would you approach this situation?",
        "Your best friend calls you and tells you that his girlfriend broke up with him. He is extremely “depressed,” and states that he wants to end his life. How would you approach this situation?",
        "You are playing football in the back garden when you accidentally kick a ball over the fence and hear a smash. You find that it has destroyed your elderly neighbour’s garden gnome, which you know holds great sentimental value to them. How would you break the news?",
        "What are the causes and treatments of autoimmune diseases such as multiple sclerosis or lupus?",
        "What are the current challenges and advances in global health and healthcare access?"
    ],
    "Computer Science": [
        "Can you tell us about your motivation for pursuing a career in computer science?",
        "Data Structures: Explain the difference between a linked list and an array.",
        "Algorithms: What is the time complexity of bubble sort and how can it be improved?",
        "Operating Systems: What is a process and what is a thread?",
        "Computer Networks: Explain the OSI model and the role of each layer.",
        "Databases: What is ACID in the context of databases?",
        "Programming: Can you explain the concept of object-oriented programming and provide an example?",
        "Computer Architecture: Explain the Von Neumann architecture and its limitations.",
        "Artificial Intelligence: What is the difference between supervised and unsupervised learning?",
        "Software Engineering: Can you describe the software development life cycle?",
        "How do you stay current with the latest trends and advancements in computer science, and what resources do you use for research and learning?",
        "Finally, what do you see as the biggest challenges facing computer science, and how do you plan to address them in your future career?",
        "What is your approach to problem solving, and how do you determine the best algorithms to use in a given situation?",
        "What do you think are the ethical implications of using computer technology in our daily lives?",
        "How do you think the computer science field can help address the issue of online misinformation and fake news?",
        "How do you think we can address the issue of privacy and security in the digital world?",
        "Tell me about binary searches. What about their efficiency? What are the tradeoffs?",
        "What is the difference between a hash table and a binary search tree?",
        "What is the difference between a stack and a queue?",
        "What happens when light has to pass through a medium denser than air?",
        "An urn contains 23 white beans and 34 black beans. A monkey takes out two beans; if they are the same, he puts a black bean into the urn, and if they are different, he puts in a white bean from a large heap he has next to him. The monkey repeats this procedure until there is only one bean left. What colour is it?",
        "What role do you think computer science should play in addressing global challenges such as climate change or economic inequality?",
        "Can you explain the difference between a sorting algorithm that is time complexity O(n^2) and one that is time complexity O(n log n)?",
        "Can you discuss the basics of computer security and the most common threats to computer systems?",
        "How do you think set theory and mathematical functions are used in computer algorithms and data structures?",
        "Can you discuss the role of probability and statistics in machine learning and artificial intelligence?",
        "What is the theory of computation and why is it important in computer science?",
        "Discuss the different types of complexity classes, including P, NP, NP-hard, and NP-complete.",
        "What is the difference between a recursive and an iterative approach to solving a problem?",
        "What is the difference between a post-order and in-order traversal in a binary tree?",
        "If you had to choose, which data structure would you use to store and retrieve a large number of items: arrays or linked lists? Why?",
        "How many computers can you fit into an empty room?",
        "What is the most challenging project you have ever worked on and why?",
        "How would you explain the concept of inheritance in object-oriented programming to a non-technical person?",
        "How would you go about solving the tower of Hanoi problem?",
        "What interests you about computer science?",
        "How would people describe you?",
        "What is your greatest strength?",
        "What is your greatest weakness?",
        "What are your preferred programming languages and why?",
        "Which is your most significant accomplishment?",
        "Death by chocolate.  You are locked in a room with your worst enemy. On a table in the centre of the room is a bar of chocolate, divided into squares in the usual way. One square of the chocolate is painted with a bright green paint that contains a deadly poison. You and your enemy take it in turns to break off one or more squares from the remaining chocolate (along a straight line) and eat them. Whoever is left with the green square must eat it and die in agony. You may look at the bar of chocolate and then decide whether to go first or second. Describe your strategy.",
        "How many pennies can you fit in your room?",
        "A windowless room has 3 lightbulbs, You are outside the room with 3 switches. One switch controls each lightbulb. You can only enter the room once. How do you determine which switch controls which lightbulb?",
        "Why is a tennis ball fuzzy?",
        "How many golf balls can you fit in a school bus?",
        "How do you stay up to date with the latest developments in computer science?",
        "The “iterated logarithm”, *, is defined as the number of times one needs to apply the base-two logarithm to a number before it is less than or equal to 1. Find a recursive formula for * and use this to find the iterated logarithm of 8",
        " A deterministic finite automaton (DFA) is a machine which is in one of a finite number of states. It starts in an initial state and changes state according to the input it receives. Some states are accepting; if the machine is in an accepting state when the input terminates, then it “accepts” the input. Otherwise it “rejects” the input. The automaton represented by this diagram accepts a string of 1s. The arrow going into the state 0 indicates that 0 is the start state. The double circle around the state 2 indicates that it is an accepting state. Each arrow labelled with a 1 indicates which state the machine moves to after receiving a 1 as input. For instance, with the input 111, the machine moves from state 0 to 1 to 2 to 3+ and as 3+ is not an accepting state, this machine rejects 111. What strings does this machine accept? Let 1n be the string consisting of n repetitions of the character 1. Explain how to construct a DFA which accepts only the string 1n. How can this be extended to make a DFA that accepts a finite set of strings, 1a, 1b, …, 1z?",
        "Why did you chose this University?",
        "What do you wnat to do after graduation?"
    ]
}